# Pandas Practice

In [119]:
import pandas as pd
import os

### Pandas 2 Main DataTypes
* Series --> 1 Dimensional
* DataFrame --> 2 Dimensional --> Python Dictionary

In [120]:
# Series
car_model = pd.Series(["BMW", "Toyota", "Honda"])
car_model

0       BMW
1    Toyota
2     Honda
dtype: object

In [121]:
# Series
car_color = pd.Series(["Red", "Blue", "White"])
car_color

0      Red
1     Blue
2    White
dtype: object

In [122]:
# Data Frame
car_data = pd.DataFrame({"Car":car_model, "Color":car_color})
car_data

      Car  Color
0     BMW    Red
1  Toyota   Blue
2   Honda  White

## Importing Data using "read_csv"

In [123]:
# get current working directory
current_dir = os.getcwd()

#Project Directory
project_dir = os.path.abspath(os.path.join(current_dir, '..', '..', '..'))

#construct the path
file_path = os.path.join(project_dir, 'data','car-sales.csv')

car_sales = pd.read_csv(file_path)
car_sales

EmptyDataError: No columns to parse from file

# Describing Data

In [ ]:
# Attribute (dtypes)
car_sales.dtypes

Make             object
Colour           object
Odometer (KM)     int64
Doors             int64
Price            object
dtype: object

In [ ]:
car_sales.columns

Index(['Make', 'Colour', 'Odometer (KM)', 'Doors', 'Price'], dtype='object')

In [ ]:
car_columns = car_sales.columns
car_columns

Index(['Make', 'Colour', 'Odometer (KM)', 'Doors', 'Price'], dtype='object')

In [ ]:
car_sales.index

RangeIndex(start=0, stop=10, step=1)

In [ ]:
# describe() gives statistical information
# describe() works on only numeric columns
car_sales.describe()

       Odometer (KM)      Doors
count      10.000000  10.000000
mean    78601.400000   4.000000
std     61983.471735   0.471405
min     11179.000000   3.000000
25%     35836.250000   4.000000
50%     57369.000000   4.000000
75%     96384.500000   4.000000
max    213095.000000   5.000000

In [ ]:
car_sales.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Make           10 non-null     object
 1   Colour         10 non-null     object
 2   Odometer (KM)  10 non-null     int64
 3   Doors          10 non-null     int64
 4   Price          10 non-null     object
dtypes: int64(2), object(3)
memory usage: 532.0+ bytes

In [ ]:
car_sales.describe().mean()

Odometer (KM)    69307.327717
Doors                4.308926
dtype: float64

In [ ]:
car_sales.sum()

Make             ToyotaHondaToyotaBMWNissanToyotaHondaHondaToyo...
Colour               WhiteRedBlueBlackWhiteGreenBlueBlueWhiteWhite
Odometer (KM)                                               786014
Doors                                                           40
Price            $4,000.00$5,000.00$7,000.00$22,000.00$3,500.00...
dtype: object

In [ ]:
car_sales.describe().sum()

Odometer (KM)    554458.621735
Doors                34.471405
dtype: float64

In [ ]:
car_sales["Doors"].sum()

40

In [ ]:
len(car_sales)

10

# Viewing and Selecting Data

In [ ]:
# head() gives a quick snapshot of the dataframe
# first 5 rows
car_sales.head()

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00

In [ ]:
car_sales.head(3)

     Make Colour  Odometer (KM)  Doors      Price
0  Toyota  White         150043      4  $4,000.00
1   Honda    Red          87899      4  $5,000.00
2  Toyota   Blue          32549      3  $7,000.00

In [ ]:
# tail() gives the bottom 5 rows or last 5 rows of the dataframe
car_sales.tail()

     Make Colour  Odometer (KM)  Doors      Price
5  Toyota  Green          99213      4  $4,500.00
6   Honda   Blue          45698      4  $7,500.00
7   Honda   Blue          54738      4  $7,000.00
8  Toyota  White          60000      4  $6,250.00
9  Nissan  White          31600      4  $9,700.00

In [ ]:
car_sales.tail(2)

     Make Colour  Odometer (KM)  Doors      Price
8  Toyota  White          60000      4  $6,250.00
9  Nissan  White          31600      4  $9,700.00

In [ ]:
# .loc and .iloc
animals = pd.Series(["cat", "dog", "bird", "fish", "snake", "pandas"], index=[0,1,3,3,2,5])
animals

0       cat
1       dog
3      bird
3      fish
2     snake
5    pandas
dtype: object

In [ ]:
# .loc refers to index
animals.loc[1]

'dog'

In [ ]:
# .loc refers to index
animals.loc[3]

3    bird
3    fish
dtype: object

In [ ]:
# .iloc refers to position
animals.iloc[3]

'fish'

In [ ]:
car_sales.loc[1]

Make                 Honda
Colour                 Red
Odometer (KM)        87899
Doors                    4
Price            $5,000.00
Name: 1, dtype: object

In [ ]:
animals

0       cat
1       dog
3      bird
3      fish
2     snake
5    pandas
dtype: object

In [ ]:
# Slicing
animals.iloc[:3]

0     cat
1     dog
3    bird
dtype: object

In [ ]:
animals.loc[:3]

0     cat
1     dog
3    bird
3    fish
dtype: object

In [ ]:
# Accessing Columns
car_sales["Make"]

0    Toyota
1     Honda
2    Toyota
3       BMW
4    Nissan
5    Toyota
6     Honda
7     Honda
8    Toyota
9    Nissan
Name: Make, dtype: object

In [ ]:
car_sales.Make

0    Toyota
1     Honda
2    Toyota
3       BMW
4    Nissan
5    Toyota
6     Honda
7     Honda
8    Toyota
9    Nissan
Name: Make, dtype: object

In [ ]:
# filtering
car_sales[car_sales["Make"] == "Toyota"]

     Make Colour  Odometer (KM)  Doors      Price
0  Toyota  White         150043      4  $4,000.00
2  Toyota   Blue          32549      3  $7,000.00
5  Toyota  Green          99213      4  $4,500.00
8  Toyota  White          60000      4  $6,250.00

In [ ]:
car_sales[car_sales["Odometer (KM)"] > 150000]

     Make Colour  Odometer (KM)  Doors      Price
0  Toyota  White         150043      4  $4,000.00
4  Nissan  White         213095      4  $3,500.00

In [ ]:
car_sales

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

In [ ]:
# crosstab
cross_doors = pd.crosstab(car_sales["Make"], car_sales["Doors"])
cross_doors

Doors   3  4  5
Make
BMW     0  0  1
Honda   0  3  0
Nissan  0  2  0
Toyota  1  3  0

In [ ]:
cross_colour = pd.crosstab(car_sales["Make"], car_sales["Colour"])
cross_colour

Colour  Black  Blue  Green  Red  White
Make
BMW         1     0      0    0      0
Honda       0     2      0    1      0
Nissan      0     0      0    0      2
Toyota      0     1      1    0      2

In [ ]:
# groupby()
numeric_columns = ["Odometer (KM)", "Doors"]
car_sales.groupby("Make")[numeric_columns].mean()

        Odometer (KM)  Doors
Make
BMW      11179.000000   5.00
Honda    62778.333333   4.00
Nissan  122347.500000   4.00
Toyota   85451.250000   3.75

In [ ]:
car_sales["Price"] = car_sales["Price"].str.replace(r'[\$,]', '', regex=True).astype(float)

In [ ]:
car_sales

     Make Colour  Odometer (KM)  Doors    Price
0  Toyota  White         150043      4   4000.0
1   Honda    Red          87899      4   5000.0
2  Toyota   Blue          32549      3   7000.0
3     BMW  Black          11179      5  22000.0
4  Nissan  White         213095      4   3500.0
5  Toyota  Green          99213      4   4500.0
6   Honda   Blue          45698      4   7500.0
7   Honda   Blue          54738      4   7000.0
8  Toyota  White          60000      4   6250.0
9  Nissan  White          31600      4   9700.0

# Manipulating Data

In [ ]:
#car_sales["Make"].str.lower()

In [ ]:
# lower specific comlumn using re-assignment
car_sales["Make"] = car_sales["Make"].str.lower()
car_sales

     Make Colour  Odometer (KM)  Doors    Price
0  toyota  White         150043      4   4000.0
1   honda    Red          87899      4   5000.0
2  toyota   Blue          32549      3   7000.0
3     bmw  Black          11179      5  22000.0
4  nissan  White         213095      4   3500.0
5  toyota  Green          99213      4   4500.0
6   honda   Blue          45698      4   7500.0
7   honda   Blue          54738      4   7000.0
8  toyota  White          60000      4   6250.0
9  nissan  White          31600      4   9700.0

In [ ]:
# get current working directory
current_dir = os.getcwd()

#Project Directory
project_dir = os.path.abspath(os.path.join(current_dir, '..', '..', '..'))

#construct the path
file_path = os.path.join(project_dir, 'data','car-sales-missing.csv')

car_sales_missing = pd.read_csv(file_path)
car_sales_missing

     Make Colour  Odometer  Doors       Price
0  Toyota  White  150043.0    4.0   $4,000.00
1   Honda    Red   87899.0    4.0   $5,000.00
2  Toyota   Blue       NaN    3.0   $7,000.00
3     BMW  Black   11179.0    5.0  $22,000.00
4  Nissan  White  213095.0    4.0   $3,500.00
5  Toyota  Green       NaN    4.0   $4,500.00
6   Honda    NaN       NaN    4.0   $7,500.00
7   Honda   Blue       NaN    4.0         NaN
8  Toyota  White   60000.0    NaN         NaN
9     NaN  White   31600.0    4.0   $9,700.00

In [ ]:
car_sales_missing["Odometer"].mean()

92302.66666666667

In [ ]:
# fill missing data using fillna()
# using inplace=True makes fill the data without re-assigning
car_sales_missing["Odometer"].fillna(car_sales_missing["Odometer"].mean(), inplace=True)

In [ ]:
car_sales_missing

     Make Colour       Odometer  Doors       Price
0  Toyota  White  150043.000000    4.0   $4,000.00
1   Honda    Red   87899.000000    4.0   $5,000.00
2  Toyota   Blue   92302.666667    3.0   $7,000.00
3     BMW  Black   11179.000000    5.0  $22,000.00
4  Nissan  White  213095.000000    4.0   $3,500.00
5  Toyota  Green   92302.666667    4.0   $4,500.00

In [ ]:
# dropna() remove the items that has a missing values
car_sales_missing_dropped = car_sales_missing.dropna()
car_sales_missing_dropped

     Make Colour       Odometer  Doors       Price
0  Toyota  White  150043.000000    4.0   $4,000.00
1   Honda    Red   87899.000000    4.0   $5,000.00
2  Toyota   Blue   92302.666667    3.0   $7,000.00
3     BMW  Black   11179.000000    5.0  $22,000.00
4  Nissan  White  213095.000000    4.0   $3,500.00
5  Toyota  Green   92302.666667    4.0   $4,500.00

In [ ]:
# convert the new data to a csv file
car_sales_missing_dropped.to_csv("car_sales_missing_dropped.csv")

In [ ]:
# Column from Series
seats_column = pd.Series([5,5,5,5,5,5])

# New Column called Seats
car_sales["Seats"] = seats_column
car_sales

     Make Colour  Odometer (KM)  Doors    Price  Seats
0  toyota  White         150043      4   4000.0    5.0
1   honda    Red          87899      4   5000.0    5.0
2  toyota   Blue          32549      3   7000.0    5.0
3     bmw  Black          11179      5  22000.0    5.0
4  nissan  White         213095      4   3500.0    5.0
5  toyota  Green          99213      4   4500.0    5.0
6   honda   Blue          45698      4   7500.0    NaN
7   honda   Blue          54738      4   7000.0    NaN
8  toyota  White          60000      4   6250.0    NaN
9  nissan  White          31600      4   9700.0    NaN

In [ ]:
car_sales["Seats"].fillna(5, inplace=True)

In [ ]:
car_sales

     Make Colour  Odometer (KM)  Doors    Price  Seats
0  toyota  White         150043      4   4000.0    5.0
1   honda    Red          87899      4   5000.0    5.0
2  toyota   Blue          32549      3   7000.0    5.0
3     bmw  Black          11179      5  22000.0    5.0
4  nissan  White         213095      4   3500.0    5.0
5  toyota  Green          99213      4   4500.0    5.0
6   honda   Blue          45698      4   7500.0    5.0
7   honda   Blue          54738      4   7000.0    5.0
8  toyota  White          60000      4   6250.0    5.0
9  nissan  White          31600      4   9700.0    5.0

In [ ]:
# Column from Python List
fuel_economy = [7.5, 9.2, 5.0, 9.6, 8.7, 4.7, 7.6, 8.7, 3.0, 4.5]
car_sales["Fuel per 100KM"] = fuel_economy
car_sales

     Make Colour  Odometer (KM)  Doors    Price  Seats  Fuel per 100KM
0  toyota  White         150043      4   4000.0    5.0             7.5
1   honda    Red          87899      4   5000.0    5.0             9.2
2  toyota   Blue          32549      3   7000.0    5.0             5.0
3     bmw  Black          11179      5  22000.0    5.0             9.6
4  nissan  White         213095      4   3500.0    5.0             8.7
5  toyota  Green          99213      4   4500.0    5.0             4.7
6   honda   Blue          45698      4   7500.0    5.0             7.6
7   honda   Blue          54738      4   7000.0    5.0             8.7
8  toyota  White          60000      4   6250.0    5.0             3.0
9  nissan  White          31600      4   9700.0    5.0             4.5

In [ ]:
car_sales["Total Fuel Used (L)"] = (car_sales["Odometer (KM)"] / 100) * car_sales["Fuel per 100KM"]
car_sales

,Make,Colour,Odometer (KM),Doors,Price,Seats,Fuel per 100KM,Total Fuel Used,Total Fuel Used (L),Number of Wheels,Passed Road Safety
0,toyota,White,150043,4,4000.0,5.0,7.5,11253.225,11253.225,4,True
1,honda,Red,87899,4,5000.0,5.0,9.2,8086.708,8086.708,4,True
2,toyota,Blue,32549,3,7000.0,5.0,5.0,1627.450,1627.450,4,True
3,bmw,Black,11179,5,22000.0,5.0,9.6,1073.184,1073.184,4,True
4,nissan,White,213095,4,3500.0,5.0,8.7,18539.265,18539.265,4,True
5,toyota,Green,99213,4,4500.0,5.0,4.7,4663.011,4663.011,4,True
6,honda,Blue,45698,4,7500.0,5.0,7.6,3473.048,3473.048,4,True
7,honda,Blue,54738,4,7000.0,5.0,8.7,4762.206,4762.206,4,True
8,toyota,White,60000,4,6250.0,5.0,3.0,1800.000,1800.000,4,True
9,nissan,White,31600,4,9700.0,5.0,4.5,1422.000,1422.000,4,True

In [ ]:
# Create a column from a Single Value
car_sales["Number of Wheels"] = 4
car_sales

,Make,Colour,Odometer (KM),Doors,Price,Seats,Fuel per 100KM,Total Fuel Used,Total Fuel Used (L),Number of Wheels
0,toyota,White,150043,4,4000.0,5.0,7.5,11253.225,11253.225,4
1,honda,Red,87899,4,5000.0,5.0,9.2,8086.708,8086.708,4
2,toyota,Blue,32549,3,7000.0,5.0,5.0,1627.450,1627.450,4
3,bmw,Black,11179,5,22000.0,5.0,9.6,1073.184,1073.184,4
4,nissan,White,213095,4,3500.0,5.0,8.7,18539.265,18539.265,4
5,toyota,Green,99213,4,4500.0,5.0,4.7,4663.011,4663.011,4
6,honda,Blue,45698,4,7500.0,5.0,7.6,3473.048,3473.048,4
7,honda,Blue,54738,4,7000.0,5.0,8.7,4762.206,4762.206,4
8,toyota,White,60000,4,6250.0,5.0,3.0,1800.000,1800.000,4
9,nissan,White,31600,4,9700.0,5.0,4.5,1422.000,1422.000,4

In [130]:
car_sales["Passed Road Safety"] = True
car_sales.dtypes

Make                    object
Colour                  object
Odometer (KM)            int64
Doors                    int64
Price                  float64
Seats                  float64
Fuel per 100KM         float64
Total Fuel Used (L)    float64
Number of Wheels         int64
Passed Road Safety        bool
dtype: object

In [ ]:
# drop() can use to drop column and it requires a axis parameter
car_sales = car_sales.drop("Total Fuel Used", axis=1)
car_sales

In [ ]:
# Shuffle data using sample()
# 0.5 means half of the data
car_sales_shuffled = car_sales.sample(frac=1)

In [154]:
car_sales_shuffled

,Make,Colour,Odometer (KM),Doors,Price,Seats,Fuel per 100KM,Total Fuel Used (L),Number of Wheels,Passed Road Safety
7,honda,Blue,54738,4,7000.0,5.0,8.7,4762.206,4,True
3,bmw,Black,11179,5,22000.0,5.0,9.6,1073.184,4,True
0,toyota,White,150043,4,4000.0,5.0,7.5,11253.225,4,True
5,toyota,Green,99213,4,4500.0,5.0,4.7,4663.011,4,True
1,honda,Red,87899,4,5000.0,5.0,9.2,8086.708,4,True
8,toyota,White,60000,4,6250.0,5.0,3.0,1800.000,4,True
6,honda,Blue,45698,4,7500.0,5.0,7.6,3473.048,4,True
2,toyota,Blue,32549,3,7000.0,5.0,5.0,1627.450,4,True
9,nissan,White,31600,4,9700.0,5.0,4.5,1422.000,4,True
4,nissan,White,213095,4,3500.0,5.0,8.7,18539.265,4,True

In [155]:
# Only select 20% of data if you're working in a millions of data
car_sales_shuffled.sample(frac=0.2)

,Make,Colour,Odometer (KM),Doors,Price,Seats,Fuel per 100KM,Total Fuel Used (L),Number of Wheels,Passed Road Safety
9,nissan,White,31600,4,9700.0,5.0,4.5,1422.000,4,True
7,honda,Blue,54738,4,7000.0,5.0,8.7,4762.206,4,True

In [146]:
# reset index
car_sales.reset_index(drop=True, inplace=True)
car_sales

,Make,Colour,Odometer (KM),Doors,Price,Seats,Fuel per 100KM,Total Fuel Used (L),Number of Wheels,Passed Road Safety,Odometer (Miles)
0,nissan,White,213095,4,3500.0,5.0,8.7,18539.265,4,True,133184.375
1,toyota,White,150043,4,4000.0,5.0,7.5,11253.225,4,True,93776.875
2,bmw,Black,11179,5,22000.0,5.0,9.6,1073.184,4,True,6986.875
3,honda,Blue,54738,4,7000.0,5.0,8.7,4762.206,4,True,34211.250
4,honda,Red,87899,4,5000.0,5.0,9.2,8086.708,4,True,54936.875
5,honda,Blue,45698,4,7500.0,5.0,7.6,3473.048,4,True,28561.250
6,toyota,White,60000,4,6250.0,5.0,3.0,1800.000,4,True,37500.000
7,nissan,White,31600,4,9700.0,5.0,4.5,1422.000,4,True,19750.000
8,toyota,Blue,32549,3,7000.0,5.0,5.0,1627.450,4,True,20343.125
9,toyota,Green,99213,4,4500.0,5.0,4.7,4663.011,4,True,62008.125

In [141]:
car_sales["Odometer (Miles)"] = car_sales["Odometer (KM)"].apply(lambda x: x/1.6)
car_sales

,Make,Colour,Odometer (KM),Doors,Price,Seats,Fuel per 100KM,Total Fuel Used (L),Number of Wheels,Passed Road Safety,Odometer (Miles)
0,nissan,White,213095,4,3500.0,5.0,8.7,18539.265,4,True,133184.375
1,toyota,White,150043,4,4000.0,5.0,7.5,11253.225,4,True,93776.875
2,bmw,Black,11179,5,22000.0,5.0,9.6,1073.184,4,True,6986.875
3,honda,Blue,54738,4,7000.0,5.0,8.7,4762.206,4,True,34211.250
4,honda,Red,87899,4,5000.0,5.0,9.2,8086.708,4,True,54936.875
5,honda,Blue,45698,4,7500.0,5.0,7.6,3473.048,4,True,28561.250
6,toyota,White,60000,4,6250.0,5.0,3.0,1800.000,4,True,37500.000
7,nissan,White,31600,4,9700.0,5.0,4.5,1422.000,4,True,19750.000
8,toyota,Blue,32549,3,7000.0,5.0,5.0,1627.450,4,True,20343.125
9,toyota,Green,99213,4,4500.0,5.0,4.7,4663.011,4,True,62008.125